# Репозиторий "Система выдачи и учета возвратов журналов"

## Описание
Этот репозиторий содержит веб-приложение для учета выдачи и возврата журналов с использованием базы данных SQLite. Основной функционал включает управление журналами, администрирование пользователей и администраторов, а также поиск по данным.

## Используемые технологии
- HTML
- CSS (без стилей в рамках текущего задания)
- JavaScript (Node.js)
- Express.js
- EJS (шаблонизатор для создания представлений)
- SQLite (база данных для хранения данных)

## Структура проекта
- /views: Папка с EJS шаблонами для представлений.
- /public: папка со стилями или иными файлами для front-end.
- app.js: Основной файл сервера Express и логики приложения.
- package.json: Файл с зависимостями Node.js.

## Запуск проекта
Для запуска проекта выполните следующие шаги:

1. Установка зависимостей:
npm install

2. Запуск сервера:
node app.js

Приложение будет доступно по адресу http://localhost:3000.

## Основные страницы и функционал
### Главная страница:
Содержит кнопки "Выдача журнала" и "Панель администратора".

### Страница Выдача журнала:
Форма для заполнения данных о выдаче журнала:
- Номер журнала
- ФИО получившего журнал.
- ФИО выдавшего журнал.
- Номер журнала (генерируется автоматически).
- Выбор типа журнала из предложенного списка.
- Выбор лекарственного препарата из предложенного списка.
- Серия/Оборудование/Помещение в свободной форме.

### Панель администратора:
Страница доступна только администратору после аутентификации:
- Название страницы и кнопка "Выйти".
- Кнопка "Создать нового администратора".
- Кнопка "Изменить пароль".
- Кнопка "Редактор справочников".
- Поле для поиска по таблице журналов.
- Таблица со столбцами:
- Получил, Выдал, Дата выдачи, Тип, Продукт, Номер журнала, Серия/Оборудование/Помещение, Дата возврата, Возврат подтвердил.
- Кнопка "Подтвердить возврат" для отметки возврата и записи данных.

## Бизнес-логика
### Выдача журнала:
- Автоматическое присвоение номера журнала в формате АЛYY-NNNN.
- Запись данных о выдаче в базу данных.

### Редактор справочников:
Данная страница позволяет редактировать справочники препаратов и наименований журналов. Страница доступна только администраторам.

### Панель администратора:
- Просмотр всех выданных журналов.
- Поиск по таблице по различным параметрам.
- Подтверждение возврата журнала с записью информации о возврате.
